Tekla Open API Reference for Tekla Structures 2025
RebarCranking.CrankedLengthType Property
 Gets or sets the cranked length type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarCranking.CrankedLengthTypeEnum CrankedLengthType { get; set; }
Public Property CrankedLengthType As RebarCranking.CrankedLengthTypeEnum
	Get
	Set
Property Value
Type: RebarCranking.CrankedLengthTypeEnum
See Also
Reference
RebarCranking Class
Tekla.Structures.Model Namespace